package com.deepsoft.haolifa.finance;

import com.alibaba.fastjson.JSON;
import com.deepsoft.haolifa.BaseTest;
import com.deepsoft.haolifa.dao.repository.*;
import com.deepsoft.haolifa.enums.DictEnum;
import com.deepsoft.haolifa.model.domain.BizCostBudgetSubjects;
import com.deepsoft.haolifa.model.domain.BizSubjects;
import com.deepsoft.haolifa.model.domain.BizSubjectsExample;
import com.deepsoft.haolifa.model.domain.SysDict;
import com.deepsoft.haolifa.model.dto.DepartmentDTO;
import com.deepsoft.haolifa.service.DepartmentService;
import com.deepsoft.haolifa.service.SysDictService;
import com.deepsoft.haolifa.service.SysUserService;
import org.apache.commons.lang3.StringUtils;
import org.junit.Test;
import org.springframework.beans.factory.annotation.Autowired;

import java.math.BigDecimal;
import java.util.Date;
import java.util.List;
import java.util.Map;
import java.util.function.Function;
import java.util.stream.Collectors;

public class CostServiceTest extends BaseTest {

    @Autowired
    private BizCostBudgetDeptMapper bizCostBudgetDeptMapper;

    @Autowired
    private BizCostBudgetSubjectsMapper bizCostBudgetSubjectsMapper;

    @Autowired
    private SysDepartmentMapper departmentMapper;

    @Autowired
    private SysUserService sysUserService;

    @Autowired
    private DepartmentService departmentService;

    @Autowired
    private BizBillMapper bizBillMapper;

    @Autowired
    private BizOtherBillMapper bizOtherBillMapper;

    @Autowired
    private BizBankBillMapper bizBankBillMapper;

    @Autowired
    private SysDictService sysDictService;
    @Autowired
    private BizSubjectsMapper subjectsMapper;

    @Autowired
    private BizSubjectsBalanceMapper subjectsBalanceMapper;

    @Test
    public void t1() {

        String str  = "[{\"序号\":1,\"费用类别\":\"管理费用\",\"明细\":\"审计费\",\"编码\":\"0000115\",\"科目描述\":\"审计所出具审计报告费用\"},{\"序号\":2,\"费用类别\":\"财务费用\",\"明细\":\"办公费\",\"编码\":\"0000201\",\"科目描述\":\"书报费，印刷费，日常办公用品费，消耗用品费，年检，审计费，其他。\"},{\"序号\":3,\"费用类别\":\"财务费用\",\"明细\":\"差旅费\",\"编码\":\"0000202\",\"科目描述\":\"职工出差发生的费用\"},{\"序号\":4,\"费用类别\":\"财务费用\",\"明细\":\"软件费\",\"编码\":\"0000203\",\"科目描述\":\"购买软件的服务费\"},{\"序号\":5,\"费用类别\":\"财务费用\",\"明细\":\"交通费\",\"编码\":\"0000204\",\"科目描述\":\"管理部门市内办公发生的交通费，培训期间发生的市内交通费等\"},{\"序号\":6,\"费用类别\":\"财务费用\",\"明细\":\"贷款\",\"编码\":\"0000205\",\"科目描述\":\"银行贷款及其他筹资方式贷款\"},{\"序号\":7,\"费用类别\":\"财务费用\",\"明细\":\"手续费\",\"编码\":\"0000206\",\"科目描述\":\"在银行结算过程中支付的手续费，办理电汇所支付的手续费、邮电费，购买空白支票、电汇单、汇票等所支付的工本费、银行转账手续费、电子回单柜年费等。\"},{\"序号\":8,\"费用类别\":\"财务费用\",\"明细\":\"贷款利息\",\"编码\":\"0000207\",\"科目描述\":\"银行贷款利息支出及其他筹资方式下支付利息支出\"},{\"序号\":9,\"费用类别\":\"财务费用\",\"明细\":\"培训费\",\"编码\":\"0000208\"},{\"序号\":10,\"费用类别\":\"税金\",\"明细\":\"增值税\",\"编码\":\"0001301\"},{\"序号\":11,\"费用类别\":\"税金\",\"明细\":\"城市维护建设税\",\"编码\":\"0001302\"},{\"序号\":12,\"费用类别\":\"税金\",\"明细\":\"教育费附加\",\"编码\":\"0001303\"},{\"序号\":13,\"费用类别\":\"税金\",\"明细\":\"地方教育费附加\",\"编码\":\"0001304\"},{\"序号\":14,\"费用类别\":\"税金\",\"明细\":\"印花税\",\"编码\":\"0001305\"},{\"序号\":15,\"费用类别\":\"税金\",\"明细\":\"土地使用税\",\"编码\":\"0001306\"},{\"序号\":16,\"费用类别\":\"税金\",\"明细\":\"企业所得税\",\"编码\":\"0001307\"},{\"序号\":17,\"费用类别\":\"税金\",\"明细\":\"残疾人就业保障金\",\"编码\":\"0001308\"},{\"序号\":18,\"费用类别\":\"税金\",\"明细\":\"房产税\",\"编码\":\"0001309\"},{\"序号\":19,\"费用类别\":\"税金\",\"明细\":\"工会经费\",\"编码\":\"0001310\"},{\"序号\":20,\"费用类别\":\"工资\",\"明细\":\"财务管理中心\",\"编码\":\"0001504\"},{\"序号\":21,\"费用类别\":\"管理费用\",\"明细\":\"知识产权费\",\"编码\":\"0000105\",\"科目描述\":\"申请的知识产权费用\"},{\"序号\":22,\"费用类别\":\"研发费用\",\"明细\":\"差旅费\",\"编码\":\"0000601\",\"科目描述\":\"研究开发活动直接相关的其他费用\"},{\"序号\":23,\"费用类别\":\"研发费用\",\"明细\":\"培训费\",\"编码\":\"0000602\",\"科目描述\":\"研究开发活动直接相关的其他费用\"},{\"序号\":24,\"费用类别\":\"研发费用\",\"明细\":\"检测费\",\"编码\":\"0000603\",\"科目描述\":\"用于研究开发活动的仪器、设备的运行维护、调整、检验、检测、维修等费用\"},{\"序号\":25,\"费用类别\":\"研发费用\",\"明细\":\"材料费\",\"编码\":\"0000604\",\"科目描述\":\"直接消耗的材料、燃料和动力费用\"},{\"序号\":26,\"费用类别\":\"研发费用\",\"明细\":\"委托加工费\",\"编码\":\"0000605\",\"科目描述\":\"企业委托境内其他机构或个人进行研究开发活动所发生的费用\"},{\"序号\":27,\"费用类别\":\"研发费用\",\"明细\":\"设备费\",\"编码\":\"0000606\",\"科目描述\":\"用于研究开发活动投入的设备\"},{\"序号\":28,\"费用类别\":\"研发费用\",\"明细\":\"工装费\",\"编码\":\"0000607\",\"科目描述\":\"用于中间试验和产品试制的模具、工艺装备开发及制造费\"},{\"序号\":29,\"费用类别\":\"研发费用\",\"明细\":\"试验费\",\"编码\":\"0000608\",\"科目描述\":\"用于研究开发活动的仪器、设备的运行维护、调整、检验、检测、维修等费用\"},{\"序号\":30,\"费用类别\":\"研发费用\",\"明细\":\"模具\",\"编码\":\"0000609\",\"科目描述\":\"用于中间试验和产品试制的模具\"},{\"序号\":31,\"费用类别\":\"研发费用\",\"明细\":\"办公费\",\"编码\":\"0000610\"},{\"序号\":32,\"费用类别\":\"研发费用\",\"明细\":\"招待费\",\"编码\":\"0000611\"},{\"序号\":33,\"费用类别\":\"固定资产\",\"明细\":\"模具\",\"编码\":\"0001205\"},{\"序号\":34,\"费用类别\":\"工资\",\"明细\":\"产品研发中心\",\"编码\":\"0001505\"},{\"序号\":35,\"费用类别\":\"质量费用\",\"明细\":\"差旅费\",\"编码\":\"0000501\",\"科目描述\":\"职工出差发生的费用\"},{\"序号\":36,\"费用类别\":\"质量费用\",\"明细\":\"认证费\",\"编码\":\"0000502\"},{\"序号\":37,\"费用类别\":\"质量费用\",\"明细\":\"培训费\",\"编码\":\"0000503\",\"科目描述\":\"讲师费/资料费/餐费/其他\"},{\"序号\":38,\"费用类别\":\"质量费用\",\"明细\":\"检测费\",\"编码\":\"0000504\"},{\"序号\":39,\"费用类别\":\"质量费用\",\"明细\":\"运费\",\"编码\":\"0000505\",\"科目描述\":\"通过运输公司发生的运费\"},{\"序号\":40,\"费用类别\":\"质量费用\",\"明细\":\"办公费\",\"编码\":\"0000506\"},{\"序号\":41,\"费用类别\":\"质量费用\",\"明细\":\"招待费\",\"编码\":\"0000507\"},{\"序号\":42,\"费用类别\":\"质量费用\",\"明细\":\"售后运费\",\"编码\":\"0000114\",\"科目描述\":\"通过运输公司发生的售后运费，售后问题不归属于生产部分的费用\"},{\"序号\":43,\"费用类别\":\"质量费用\",\"明细\":\"售后费用\",\"编码\":\"0000115\",\"科目描述\":\"为履行合同约定的明确的售后条款内容应发生的一切费用，售后问题不归属于生产部分的费用\"},{\"序号\":44,\"费用类别\":\"工资\",\"明细\":\"技术质量管理中心\",\"编码\":\"0001503\"},{\"序号\":45,\"费用类别\":\"采购费用\",\"明细\":\"差旅费\",\"编码\":\"0000301\",\"科目描述\":\"职工出差发生的费用\"},{\"序号\":46,\"费用类别\":\"采购费用\",\"明细\":\"招待费\",\"编码\":\"0000302\",\"科目描述\":\"对外招待供应商发生的餐费及职工内部聚餐发生的费用\"},{\"序号\":47,\"费用类别\":\"采购费用\",\"明细\":\"办公费\",\"编码\":\"0000303\",\"科目描述\":\"书报费，印刷费，日常办公用品费，消耗用品费，其他。\"},{\"序号\":48,\"费用类别\":\"采购费用\",\"明细\":\"运费\",\"编码\":\"0000304\",\"科目描述\":\"采购材料通过运输公司发生的运费\"},{\"序号\":49,\"费用类别\":\"采购费用\",\"明细\":\"交通费\",\"编码\":\"0000305\",\"科目描述\":\"管理部门市内办公发生的交通费，培训期间发生的市内交通费等\"},{\"序号\":50,\"费用类别\":\"采购费用\",\"明细\":\"其它\",\"编码\":\"0000306\",\"科目描述\":\"与采购有关未列明的费用\"},{\"序号\":51,\"费用类别\":\"生产费用\",\"明细\":\"折旧费\",\"编码\":\"0000401\",\"科目描述\":\"生产车间使用的固定资产每月所计提的折旧。\"},{\"序号\":52,\"费用类别\":\"生产费用\",\"明细\":\"刀具\",\"编码\":\"0000402\",\"科目描述\":\"生产车间购买的低值易耗品\"},{\"序号\":53,\"费用类别\":\"生产费用\",\"明细\":\"夹具\",\"编码\":\"0000403\",\"科目描述\":\"生产车间购买的低值易耗品\"},{\"序号\":54,\"费用类别\":\"生产费用\",\"明细\":\"量具\",\"编码\":\"0000404\",\"科目描述\":\"生产车间购买的低值易耗品\"},{\"序号\":55,\"费用类别\":\"生产费用\",\"明细\":\"工具\",\"编码\":\"0000405\",\"科目描述\":\"生产车间购买的低值易耗品\"},{\"序号\":56,\"费用类别\":\"生产费用\",\"明细\":\"售后费用\",\"编码\":\"0000406\",\"科目描述\":\"为履行合同约定的明确的售后条款内容应发生的一切费用，售后问题不归属于生产部分的费用\"},{\"序号\":57,\"费用类别\":\"生产费用\",\"明细\":\"招待费\",\"编码\":\"0000407\",\"科目描述\":\"对外招待客户发生的餐费及职工内部聚餐发生的费用\"},{\"序号\":58,\"费用类别\":\"生产费用\",\"明细\":\"劳保费\",\"编码\":\"0000408\",\"科目描述\":\"公司为职工购买劳保用品所发生的费用\"},{\"序号\":59,\"费用类别\":\"生产费用\",\"明细\":\"维修费\",\"编码\":\"0000409\",\"科目描述\":\"生产线的日常修理费\"},{\"序号\":60,\"费用类别\":\"生产费用\",\"明细\":\"委托加工费\",\"编码\":\"0000410\",\"科目描述\":\"委托外单位加工的各种物资的实际成本\"},{\"序号\":61,\"费用类别\":\"销售费用\",\"明细\":\"差旅费\",\"编码\":\"0000801\",\"科目描述\":\"职工因工作外出期间发生的住宿费，交通费等，包括：交通车费、交通机票、住宿费、伙食补贴、其他相关的费用\"},{\"序号\":62,\"费用类别\":\"销售费用\",\"明细\":\"招待费\",\"编码\":\"0000802\",\"科目描述\":\"销售部门发生的与销售活动有关的业务招待费支出，具体包括：餐饮费、礼品费、其他相关的费用\"},{\"序号\":63,\"费用类别\":\"销售费用\",\"明细\":\"运费\",\"编码\":\"0000803\",\"科目描述\":\"为销售货物而发生的产品运输费用\"},{\"序号\":64,\"费用类别\":\"销售费用\",\"明细\":\"展会费\",\"编码\":\"0000805\",\"科目描述\":\"为开展促销或宣传产品等举办展览、展销会所支出的各项具有公共性质的费用，包括：资料费、礼品费、及其他相关的开支。\"},{\"序号\":65,\"费用类别\":\"销售费用\",\"明细\":\"办公费\",\"编码\":\"0000806\"},{\"序号\":66,\"费用类别\":\"固定资产\",\"明细\":\"机器\",\"编码\":\"0001203\"},{\"序号\":67,\"费用类别\":\"固定资产\",\"明细\":\"设备\",\"编码\":\"0001204\"},{\"序号\":68,\"费用类别\":\"固定资产\",\"明细\":\"器具\",\"编码\":\"0001207\"},{\"序号\":69,\"费用类别\":\"固定资产\",\"明细\":\"工具\",\"编码\":\"0001208\"},{\"序号\":70,\"费用类别\":\"材料费\",\"明细\":\"原材料\",\"编码\":\"0001401\"},{\"序号\":71,\"费用类别\":\"材料费\",\"明细\":\"辅助材料\",\"编码\":\"0001402\"},{\"序号\":72,\"费用类别\":\"材料费\",\"明细\":\"整机采购\",\"编码\":\"0001403\"},{\"序号\":73,\"费用类别\":\"工资\",\"明细\":\"经营管理中心\",\"编码\":\"0001502\"},{\"序号\":74,\"费用类别\":\"工资\",\"明细\":\"机加事业部\",\"编码\":\"0001506\"},{\"序号\":75,\"费用类别\":\"工资\",\"明细\":\"控制阀事业部\",\"编码\":\"0001507\"},{\"序号\":76,\"费用类别\":\"工资\",\"明细\":\"覆层事业部\",\"编码\":\"0001508\"},{\"序号\":77,\"费用类别\":\"工资\",\"明细\":\"装配事业部\",\"编码\":\"0001509\"},{\"序号\":78,\"费用类别\":\"工资\",\"明细\":\"橡胶事业部\",\"编码\":\"0001510\"},{\"序号\":79,\"费用类别\":\"工资\",\"明细\":\"生产部\",\"编码\":\"0001511\"},{\"序号\":80,\"费用类别\":\"管理费用\",\"明细\":\"差旅费\",\"编码\":\"0000101\",\"科目描述\":\"职工出差发生的费用\"},{\"序号\":81,\"费用类别\":\"管理费用\",\"明细\":\"招待费\",\"编码\":\"0000102\",\"科目描述\":\"对外招待客户发生的餐费及职工内部聚餐发生的费用\"},{\"序号\":82,\"费用类别\":\"管理费用\",\"明细\":\"通讯费\",\"编码\":\"0000103\",\"科目描述\":\"办公室有线电话使用费\"},{\"序号\":83,\"费用类别\":\"管理费用\",\"明细\":\"交通费\",\"编码\":\"0000104\",\"科目描述\":\"管理部门市内办公发生的交通费，培训期间发生的市内交通费等\"},{\"序号\":84,\"费用类别\":\"管理费用\",\"明细\":\"劳保费\",\"编码\":\"0000106\",\"科目描述\":\"公司为职工购买劳保用品所发生的费用\"},{\"序号\":85,\"费用类别\":\"管理费用\",\"明细\":\"办公费\",\"编码\":\"0000107\",\"科目描述\":\"书报费，印刷费，日常办公用品费，消耗用品费，年检，审计费，其他。\"},{\"序号\":86,\"费用类别\":\"管理费用\",\"明细\":\"修理费\",\"编码\":\"0000108\",\"科目描述\":\"包含电脑，空调，打印机，复印机等的修理安装费，硬件升级费，办公楼装修费，其他管理部办公用品移动和安装费等。\"},{\"序号\":87,\"费用类别\":\"管理费用\",\"明细\":\"职工福利费\",\"编码\":\"0000109\",\"科目描述\":\"包括医疗用品，公司组织职工体检费，工伤医疗费，工作人员租房费，餐厅用厨具，夜班补助，职工慰问金。\"},{\"序号\":88,\"费用类别\":\"管理费用\",\"明细\":\"折旧费\",\"编码\":\"0000110\",\"科目描述\":\"管理部使用的固定资产每月所计提的折旧。\"},{\"序号\":89,\"费用类别\":\"管理费用\",\"明细\":\"咨询服务费\",\"编码\":\"0000111\",\"科目描述\":\"包含公司聘请律师顾问费、会计税务咨询费及其他信息咨询费用\"},{\"序号\":90,\"费用类别\":\"管理费用\",\"明细\":\"物料消耗\",\"编码\":\"0000112\",\"科目描述\":\"购买硬盘、光盘、软盘等电脑用品，以及插座等维修零件\"},{\"序号\":91,\"费用类别\":\"管理费用\",\"明细\":\"礼品费\",\"编码\":\"0000113\",\"科目描述\":\"节日福利\"},{\"序号\":92,\"费用类别\":\"管理费用\",\"明细\":\"会议费\",\"编码\":\"0000114\",\"科目描述\":\"公司召开董事会发生的会议费\"},{\"序号\":93,\"费用类别\":\"管理费用\",\"明细\":\"培训费\",\"编码\":\"0000116\",\"科目描述\":\"讲师费/资料费/餐费/其他\"},{\"序号\":94,\"费用类别\":\"管理费用\",\"明细\":\"无形资产摊销\",\"编码\":\"0000117\",\"科目描述\":\"指月底对公司所拥有的无形资产分期摊销，结转费用\"},{\"序号\":95,\"费用类别\":\"管理费用\",\"明细\":\"其它\",\"编码\":\"0000118\",\"科目描述\":\"与管理有关未列明的费用\"},{\"序号\":96,\"费用类别\":\"管理费用\",\"明细\":\"专项福利费\",\"编码\":\"0000119\"},{\"序号\":97,\"费用类别\":\"管理费用\",\"明细\":\"领导费用\",\"编码\":\"0000120\"},{\"序号\":98,\"费用类别\":\"能耗费用\",\"明细\":\"生产电费\",\"编码\":\"0000701\",\"科目描述\":\"生产车间消耗电的费用\"},{\"序号\":99,\"费用类别\":\"能耗费用\",\"明细\":\"生产水费\",\"编码\":\"0000702\",\"科目描述\":\"生产车间消耗水的费用\"},{\"序号\":100,\"费用类别\":\"能耗费用\",\"明细\":\"办公电费\",\"编码\":\"0000703\",\"科目描述\":\"管理部门消耗电的费用\"},{\"序号\":101,\"费用类别\":\"能耗费用\",\"明细\":\"办公水费\",\"编码\":\"0000704\",\"科目描述\":\"管理部门消耗水的费用\"},{\"序号\":102,\"费用类别\":\"车辆费用\",\"明细\":\"油费\",\"编码\":\"0000901\",\"科目描述\":\"车辆使用汽油、机油的费用\"},{\"序号\":103,\"费用类别\":\"车辆费用\",\"明细\":\"年检费\",\"编码\":\"0000902\",\"科目描述\":\"车辆发生的年检费\"},{\"序号\":104,\"费用类别\":\"车辆费用\",\"明细\":\"保险费\",\"编码\":\"0000903\",\"科目描述\":\"包含公司投的车辆保险费等\"},{\"序号\":105,\"费用类别\":\"车辆费用\",\"明细\":\"维修费\",\"编码\":\"0000904\",\"科目描述\":\"车辆的修理维护费\"},{\"序号\":106,\"费用类别\":\"车辆费用\",\"明细\":\"过路费\",\"编码\":\"0000905\",\"科目描述\":\"使用的车辆按国家规定所交的公路过路费\"},{\"序号\":107,\"费用类别\":\"车辆费用\",\"明细\":\"租赁费\",\"编码\":\"0000906\",\"科目描述\":\"租用车辆发生的费用\"},{\"序号\":108,\"费用类别\":\"租金\",\"科目描述\":\"包括厂房租赁费，会议室租赁费，职工宿舍房租，其他的管理部门使用场地时发生的场地费用。\"},{\"序号\":109,\"费用类别\":\"社保\",\"明细\":\"养老保险\",\"编码\":\"0001101\",\"科目描述\":\"公司和个人按一定工资比例交纳的保险\"},{\"序号\":110,\"费用类别\":\"社保\",\"明细\":\"工伤保险\",\"编码\":\"0001102\",\"科目描述\":\"公司按一定工资比例交纳的保险\"},{\"序号\":111,\"费用类别\":\"社保\",\"明细\":\"医疗保险\",\"编码\":\"0001103\",\"科目描述\":\"公司和个人按一定工资比例交纳的保险\"},{\"序号\":112,\"费用类别\":\"社保\",\"明细\":\"失业保险\",\"编码\":\"0001104\",\"科目描述\":\"公司按一定工资比例交纳的保险\"},{\"序号\":113,\"费用类别\":\"固定资产\",\"明细\":\"房屋\",\"编码\":\"0001201\"},{\"序号\":114,\"费用类别\":\"固定资产\",\"明细\":\"建筑物\",\"编码\":\"0001202\"},{\"序号\":115,\"费用类别\":\"固定资产\",\"明细\":\"运输工具\",\"编码\":\"0001206\"},{\"序号\":116,\"费用类别\":\"固定资产\",\"明细\":\"家具\",\"编码\":\"0001209\"},{\"序号\":117,\"费用类别\":\"固定资产\",\"明细\":\"电子设备\",\"编码\":\"0001210\"},{\"序号\":118,\"费用类别\":\"工资\",\"明细\":\"行政管理中心\",\"编码\":\"0001501\"}]";

//        INSERT INTO `haolifa`.`biz_subjects`
//        (`id`, `name`, `type`, `parent_id`, `level`, `code`, `remark`, `status`, `del_flag`, `percent`, `create_user`, `create_time`, `update_user`, `update_time`)
//        VALUES
//        (17, '差旅费', '00001', 0, 0, '0000101', '职工出差发生的费用', '0', '0', 0, NULL, NULL, NULL, NULL);

        Map<String, String> dictMap = sysDictService.getSysDictByTypeCode(DictEnum.SUBJECTS_TYPE.getCode()).stream()
            .collect(Collectors.toMap(SysDict::getName, SysDict::getCode, (a, b) -> a));

        List<Map> parseArray = JSON.parseArray(str, Map.class);
        for (int i = 0; i < parseArray.size(); i++) {
            Map map = parseArray.get(i);
            Object mx = map.get("明细");
            if (mx == null){
                continue;
            }

            BizSubjects bizSubjects = new BizSubjects();
            bizSubjects.setId(Integer.parseInt(map.get("序号").toString()));
            bizSubjects.setName(map.get("明细").toString());
            String fylb = dictMap.get(map.get("费用类别").toString());
            bizSubjects.setType(fylb);
            bizSubjects.setCode(map.get("编码").toString());
            bizSubjects.setRemark(map.get("科目描述") == null ? null:map.get("科目描述").toString());
            int insertId = subjectsMapper.insertSelective(bizSubjects);
        }

    }

    @Test
    public void t2() {

        String str  = "1:管理费用:差旅费:新产品项目副总办:0.06500;\n" +
            "2:管理费用:差旅费:行政管理中心:0.06500;\n" +
            "3:管理费用:招待费:新产品项目副总办:0.02500;\n" +
            "4:管理费用:招待费:行政管理中心:0.02500;\n" +
            "5:管理费用:通讯费:行政管理中心:0.02500;\n" +
            "6:管理费用:交通费:行政管理中心:0.00050;\n" +
            "7:管理费用:交通费:新产品项目副总办:0.00050;\n" +
            "8:管理费用:知识产权费:产品研发中心:0.07000;\n" +
            "9:管理费用:劳保费:行政管理中心:0.00300;\n" +
            "10:管理费用:办公费:新产品项目副总办:0.25000;\n" +
            "11:管理费用:办公费:行政管理中心:0.25000;\n" +
            "12:管理费用:修理费:新产品项目副总办:0.01000;\n" +
            "13:管理费用:修理费:行政管理中心:0.00500;\n" +
            "14:管理费用:职工福利费:行政管理中心:0.03000;\n" +
            "15:管理费用:折旧费:行政管理中心:0.01500;\n" +
            "16:管理费用:咨询服务费:行政管理中心:0.03000;\n" +
            "17:管理费用:物料消耗:行政管理中心:0.01500;\n" +
            "18:管理费用:礼品费:新产品项目副总办:0.00400;\n" +
            "19:管理费用:礼品费:行政管理中心:0.00400;\n" +
            "20:管理费用:会议费:行政管理中心:0.00500;\n" +
            "21:管理费用:审计费:财务管理中心:0.03000;\n" +
            "22:管理费用:培训费:行政管理中心:0.00500;\n" +
            "23:管理费用:培训费:新产品项目副总办:0.00500;\n" +
            "24:管理费用:无形资产摊销:行政管理中心:0.00000;\n" +
            "25:管理费用:其它:行政管理中心:0.04500;\n" +
            "26:管理费用:专项福利费:行政管理中心:0.09000;\n" +
            "27:管理费用:领导费用:行政管理中心:0.14000;\n" +
            "28:财务费用:办公费:财务管理中心:0.01000;\n" +
            "29:财务费用:差旅费:财务管理中心:0.00500;\n" +
            "30:财务费用:软件费:财务管理中心:0.00500;\n" +
            "31:财务费用:交通费:财务管理中心:0.00100;\n" +
            "32:财务费用:贷款:财务管理中心:11.12000;\n" +
            "33:财务费用:手续费:财务管理中心:0.03000;\n" +
            "34:财务费用:贷款利息:财务管理中心:0.85000;\n" +
            "35:财务费用:培训费:财务管理中心:0.01000;\n" +
            "36:采购费用:差旅费:经营管理中心:0.00500;\n" +
            "37:采购费用:招待费:经营管理中心:0.00500;\n" +
            "38:采购费用:办公费:经营管理中心:0.00100;\n" +
            "39:采购费用:运费:经营管理中心:0.80000;\n" +
            "40:采购费用:交通费:经营管理中心:0.00500;\n" +
            "41:采购费用:其它:经营管理中心:0.00500;\n" +
            "42:生产费用:折旧费:原产品项目生产部:0.00000;\n" +
            "43:生产费用:折旧费:新产品项目生产部:0.00000;\n" +
            "44:生产费用:刀具:原产品项目生产部:0.07500;\n" +
            "45:生产费用:刀具:新产品项目生产部:0.07500;\n" +
            "46:生产费用:夹具:原产品项目生产部:0.02000;\n" +
            "47:生产费用:夹具:新产品项目生产部:0.02000;\n" +
            "48:生产费用:量具:原产品项目生产部:0.01300;\n" +
            "49:生产费用:量具:新产品项目生产部:0.01300;\n" +
            "50:生产费用:工具:原产品项目生产部:0.07500;\n" +
            "51:生产费用:工具:新产品项目生产部:0.07500;\n" +
            "52:生产费用:售后费用:原产品项目生产部:0.01000;\n" +
            "53:生产费用:售后费用:新产品项目生产部:0.01000;\n" +
            "54:生产费用:招待费:原产品项目生产部:0.00050;\n" +
            "55:生产费用:招待费:新产品项目生产部:0.00050;\n" +
            "56:生产费用:劳保费:原产品项目生产部:0.03000;\n" +
            "57:生产费用:劳保费:新产品项目生产部:0.03000;\n" +
            "58:生产费用:维修费:原产品项目生产部:0.05000;\n" +
            "59:生产费用:维修费:新产品项目生产部:0.05000;\n" +
            "60:生产费用:委托加工费:原产品项目生产部:0.02500;\n" +
            "61:生产费用:委托加工费:新产品项目生产部:0.02500;\n" +
            "62:质量费用:差旅费:质量管理中心:0.01000;\n" +
            "63:质量费用:认证费:质量管理中心:0.05500;\n" +
            "64:质量费用:培训费:质量管理中心:0.01500;\n" +
            "65:质量费用:检测费:质量管理中心:0.02000;\n" +
            "66:质量费用:运费:质量管理中心:0.01500;\n" +
            "67:质量费用:办公费:质量管理中心:0.01000;\n" +
            "68:质量费用:招待费:质量管理中心:0.00500;\n" +
            "69:质量费用:售后运费:质量管理中心:0.02000;\n" +
            "70:质量费用:售后费用:质量管理中心:0.01500;\n" +
            "71:研发费用:差旅费:产品研发中心:0.05600;\n" +
            "72:研发费用:培训费:产品研发中心:0.03000;\n" +
            "73:研发费用:检测费:产品研发中心:0.05000;\n" +
            "74:研发费用:材料费:产品研发中心:0.12000;\n" +
            "75:研发费用:委托加工费:产品研发中心:0.01000;\n" +
            "76:研发费用:设备费:产品研发中心:0.03000;\n" +
            "77:研发费用:工装费:产品研发中心:0.03000;\n" +
            "78:研发费用:试验费:产品研发中心:0.01000;\n" +
            "79:研发费用:模具:产品研发中心:1.00000;\n" +
            "80:研发费用:办公费:产品研发中心:0.05000;\n" +
            "81:研发费用:招待费:产品研发中心:0.00500;\n" +
            "82:能耗费用:生产电费:行政管理中心:0.65000;\n" +
            "83:能耗费用:生产水费:行政管理中心:0.01300;\n" +
            "84:能耗费用:办公电费:行政管理中心:0.00000;\n" +
            "85:能耗费用:办公水费:行政管理中心:0.00000;\n" +
            "86:销售费用:差旅费:经营管理中心:0.01000;\n" +
            "87:销售费用:招待费:经营管理中心:0.00500;\n" +
            "88:销售费用:运费:财务管理中心:2.87000;\n" +
            "89:销售费用:展会费:经营管理中心:0.30000;\n" +
            "90:销售费用:办公费:经营管理中心:0.00500;\n" +
            "91:车辆费用:油费:行政管理中心:0.07000;\n" +
            "92:车辆费用:油费:新产品项目副总办:0.07000;\n" +
            "93:车辆费用:年检费:行政管理中心:0.00500;\n" +
            "94:车辆费用:保险费:行政管理中心:0.03800;\n" +
            "95:车辆费用:维修费:行政管理中心:0.02250;\n" +
            "96:车辆费用:维修费:新产品项目副总办:0.02250;\n" +
            "97:车辆费用:过路费:行政管理中心:0.00150;\n" +
            "98:车辆费用:过路费:新产品项目副总办:0.00150;\n" +
            "99:车辆费用:租赁费:行政管理中心:0.00000;\n" +
            "100:租金:租金:行政管理中心:0.33000;\n" +
            "101:社保:养老保险:行政管理中心:1.15000;\n" +
            "102:社保:工伤保险:行政管理中心:0.08000;\n" +
            "103:社保:医疗保险:行政管理中心:0.45000;\n" +
            "104:社保:失业保险:行政管理中心:0.00000;\n" +
            "105:固定资产:房屋:行政管理中心:0.00000;\n" +
            "106:固定资产:建筑物:行政管理中心:0.00000;\n" +
            "107:固定资产:机器:经营管理中心:0.00000;\n" +
            "108:固定资产:设备:经营管理中心:0.15000;\n" +
            "109:固定资产:模具:产品研发中心:0.00000;\n" +
            "110:固定资产:运输工具:行政管理中心:0.00000;\n" +
            "111:固定资产:器具:经营管理中心:0.00000;\n" +
            "112:固定资产:工具:经营管理中心:0.05000;\n" +
            "113:固定资产:家具:行政管理中心:0.00000;\n" +
            "114:固定资产:电子设备:行政管理中心:0.75000;\n" +
            "115:税金:增值税:财务管理中心:3.00000;\n" +
            "116:税金:城市维护建设税:财务管理中心:0.21000;\n" +
            "117:税金:教育费附加:财务管理中心:0.09000;\n" +
            "118:税金:地方教育费附加:财务管理中心:0.06000;\n" +
            "119:税金:印花税:财务管理中心:0.03000;\n" +
            "120:税金:土地使用税:财务管理中心:0.08000;\n" +
            "121:税金:企业所得税:财务管理中心:0.13000;\n" +
            "122:税金:残疾人就业保障金:财务管理中心:0.13000;\n" +
            "123:税金:房产税:财务管理中心:0.40000;\n" +
            "124:税金:工会经费:财务管理中心:0.09100;\n" +
            "125:材料费:原材料:经营管理中心:56.67300;\n" +
            "126:材料费:辅助材料:经营管理中心:4.50000;\n" +
            "127:材料费:整机采购:经营管理中心:0.60000;\n" +
            "128:工资:行政管理中心:行政管理中心:0.43000;\n" +
            "129:工资:经营管理中心:经营管理中心:0.58000;\n" +
            "130:工资:技术质量管理中心:质量管理中心:0.83000;\n" +
            "131:工资:财务管理中心:财务管理中心:0.62000;\n" +
            "132:工资:产品研发中心:产品研发中心:2.05000;\n" +
            "133:工资:机加事业部:经营管理中心:1.17000;\n" +
            "134:工资:控制阀事业部:经营管理中心:0.55000;\n" +
            "135:工资:覆层事业部:经营管理中心:0.60000;\n" +
            "136:工资:装配事业部:经营管理中心:1.40000;\n" +
            "137:工资:橡胶事业部:经营管理中心:1.20000;\n" +
            "138:工资:生产部:经营管理中心:1.35000;";



        BizSubjectsExample bizSubjectsExample = new BizSubjectsExample();
        bizSubjectsExample.createCriteria();
        List<BizSubjects> bizSubjectsList = subjectsMapper.selectByExample(bizSubjectsExample);
        Map<String, List<BizSubjects>> typeListMap = bizSubjectsList.stream()
            .collect(Collectors.groupingBy(BizSubjects::getType));
//            .collect(Collectors.toMap(BizSubjects::getName, Function.identity(), (c, b) -> c));

        Map<String, String> dictMap = sysDictService.getSysDictByTypeCode(DictEnum.SUBJECTS_TYPE.getCode()).stream()
            .collect(Collectors.toMap(SysDict::getName, SysDict::getCode, (a, b) -> a));



        Map<String, Integer> departmentMap = departmentService.getDepartments().stream()
            .collect(Collectors.toMap(DepartmentDTO::getDeptName, DepartmentDTO::getId));


        String[] arr_01 = str.split(";");

        for (int i = 0; i < arr_01.length; i++) {
            String[] arr_02 = arr_01[i].split(":");

            // 138:工资:生产部:经营管理中心:1.35000
            // 138
            String f_00 =  arr_02[0];
            // 费用类别 工资
            String f_01 =  arr_02[1];
            // 明细 生产部
            String f_02 =  arr_02[2];
            // 部门 经营管理中心
            String f_03 =  arr_02[3];
            // 占比 1.35000
            String f_04 =  arr_02[4];

            String code = dictMap.get(f_01);
            if (StringUtils.isEmpty(code)){
                continue;
            }
            Map<String, BizSubjects> subjectsMap = typeListMap.get(code).stream()
                .collect(Collectors.toMap(BizSubjects::getName, Function.identity(), (c, b) -> c));

            BizSubjects subjects = subjectsMap.get(f_02);
            if (subjects == null){
                continue;
            }

            // 序号	费用类别	类别编码	明细	明细编码	归属部门	明细占部门预算比
            // INSERT INTO `haolifa`.`biz_cost_budget_subjects`
            // (`id`, `name`, `dept_id`, `subjects_type`, `subjects_id`, `cost_ratio`, `status`, `remark`, `del_flag`, `create_user`, `create_time`, `update_user`, `update_time`)
            // VALUES
            // (150, '差旅费', 24, '00003', 44, 0.012, '0', '', '0', NULL, NULL, NULL, NULL);

            BizCostBudgetSubjects costBudget = new BizCostBudgetSubjects();

            Double ys = new BigDecimal(f_04).setScale(5,BigDecimal.ROUND_HALF_UP).doubleValue();
            costBudget.setCostRatio(ys);
            costBudget.setSubjectsId(subjects.getId());
            costBudget.setName(subjects.getName());
            costBudget.setDeptId(departmentMap.get(f_03));
            costBudget.setSubjectsType(subjects.getType());

            System.out.println(f_00);
            System.out.println(JSON.toJSONString(costBudget));
            int insertId = bizCostBudgetSubjectsMapper.insertSelective(costBudget);
        }

    }


}
